{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 16, 32, 1], "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001Z\nimage_datar\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-13-2221e685cecc>\u00da\u0013normalize_greyscale\u0005\u0000\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 2, "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "bias": true, "input_dtype": "float32", "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 16, 32, 1], "name": "convolution2d_1", "dim_ordering": "tf", "nb_row": 3, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [4, 4], "strides": [4, 4], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 42, "W_regularizer": null, "bias": true, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "name": "dense_1", "trainable": true, "activation": "linear"}}], "keras_version": "1.2.0"}